[Survived] ArrayDeclaration
src/transcriptManager.ts:11:36
 export type Transcript = { student: Student, grades: CourseGrade[] };
 
 // the database of transcript
-let allTranscripts: Transcript[] = [];
+let allTranscripts: Transcript[] = ["Stryker was here"];
 
 export function initialize(): void {

[Killed] BlockStatement
src/transcriptManager.ts:13:36
 // the database of transcript
 let allTranscripts: Transcript[] = [];
 
-export function initialize(): void {
-  allTranscripts = [];
-}
+export function initialize(): void {}
 
 export function addDemoData(): void {
killedBy: TranscriptManager Adding grades Should throw an error if the student ID is invalid
statusReason: Error: expect(received).toThrowError()

Received function did not throw

[Killed] ArrayDeclaration
src/transcriptManager.ts:14:20
 let allTranscripts: Transcript[] = [];
 
 export function initialize(): void {
-  allTranscripts = [];
+  allTranscripts = ["Stryker was here"];
 }
 
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: TypeError: Cannot read properties of undefined (reading 'studentID')

[NoCoverage] BlockStatement
src/transcriptManager.ts:17:37
   allTranscripts = [];
 }
 
-export function addDemoData(): void {
-  addStudent('avery', [{ course: 'DemoClass', grade: 100 }, { course: 'DemoClass2', grade: 100 }]);
-  addStudent('blake', [{ course: 'DemoClass', grade: 80 }]);
-  addStudent('blake', [{ course: 'DemoClass', grade: 85 }, { course: 'DemoClass', grade: 40 }]);
-  addStudent('casey', [{ course: 'DemoClass', grade: 100 }]);
-}
+export function addDemoData(): void {}
 
 export function getAll(): Transcript[] {

[NoCoverage] ArrayDeclaration
src/transcriptManager.ts:18:23
 }
 
 export function addDemoData(): void {
-  addStudent('avery', [{ course: 'DemoClass', grade: 100 }, { course: 'DemoClass2', grade: 100 }]);
+  addStudent('avery', []);
   addStudent('blake', [{ course: 'DemoClass', grade: 80 }]);
   addStudent('blake', [{ course: 'DemoClass', grade: 85 }, { course: 'DemoClass', grade: 40 }]);

[NoCoverage] ObjectLiteral
src/transcriptManager.ts:19:24
 
 export function addDemoData(): void {
   addStudent('avery', [{ course: 'DemoClass', grade: 100 }, { course: 'DemoClass2', grade: 100 }]);
-  addStudent('blake', [{ course: 'DemoClass', grade: 80 }]);
+  addStudent('blake', [{}]);
   addStudent('blake', [{ course: 'DemoClass', grade: 85 }, { course: 'DemoClass', grade: 40 }]);
   addStudent('casey', [{ course: 'DemoClass', grade: 100 }]);

[NoCoverage] ArrayDeclaration
src/transcriptManager.ts:19:23
 
 export function addDemoData(): void {
   addStudent('avery', [{ course: 'DemoClass', grade: 100 }, { course: 'DemoClass2', grade: 100 }]);
-  addStudent('blake', [{ course: 'DemoClass', grade: 80 }]);
+  addStudent('blake', []);
   addStudent('blake', [{ course: 'DemoClass', grade: 85 }, { course: 'DemoClass', grade: 40 }]);
   addStudent('casey', [{ course: 'DemoClass', grade: 100 }]);

[NoCoverage] StringLiteral
src/transcriptManager.ts:20:34
 export function addDemoData(): void {
   addStudent('avery', [{ course: 'DemoClass', grade: 100 }, { course: 'DemoClass2', grade: 100 }]);
   addStudent('blake', [{ course: 'DemoClass', grade: 80 }]);
-  addStudent('blake', [{ course: 'DemoClass', grade: 85 }, { course: 'DemoClass', grade: 40 }]);
+  addStudent('blake', [{ course: "", grade: 85 }, { course: 'DemoClass', grade: 40 }]);
   addStudent('casey', [{ course: 'DemoClass', grade: 100 }]);
 }

[NoCoverage] StringLiteral
src/transcriptManager.ts:20:14
 export function addDemoData(): void {
   addStudent('avery', [{ course: 'DemoClass', grade: 100 }, { course: 'DemoClass2', grade: 100 }]);
   addStudent('blake', [{ course: 'DemoClass', grade: 80 }]);
-  addStudent('blake', [{ course: 'DemoClass', grade: 85 }, { course: 'DemoClass', grade: 40 }]);
+  addStudent("", [{ course: 'DemoClass', grade: 85 }, { course: 'DemoClass', grade: 40 }]);
   addStudent('casey', [{ course: 'DemoClass', grade: 100 }]);
 }

[Killed] BlockStatement
src/transcriptManager.ts:24:40
   addStudent('casey', [{ course: 'DemoClass', grade: 100 }]);
 }
 
-export function getAll(): Transcript[] {
-  return allTranscripts;
-}
+export function getAll(): Transcript[] {}
 
 // manages the student IDs
killedBy: TranscriptManager getAll Should return the transcripts
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/transcriptManager.ts:32:33
 class StudentIDManager {
   private static lastUsedID = 0;
 
-  public static newID(): number {
-    this.lastUsedID++;
-    return this.lastUsedID;
-  }
+  public static newID(): number {}
 }
 
killedBy: TranscriptManager Create student should return an ID, starting with 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] UpdateOperator
src/transcriptManager.ts:33:5
   private static lastUsedID = 0;
 
   public static newID(): number {
-    this.lastUsedID++;
+    this.lastUsedID--;
     return this.lastUsedID;
   }
killedBy: TranscriptManager Create student should return an ID, starting with 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/transcriptManager.ts:39:81
 }
 
 // relies on freshness of studentIDs.
-export function addStudent(name: string, grades: CourseGrade[] = []): StudentID {
-  const newID = StudentIDManager.newID();
-  const newStudent = { studentID: newID, studentName: name };
-  allTranscripts.push({ student: newStudent, grades });
-  return newID;
-}
+export function addStudent(name: string, grades: CourseGrade[] = []): StudentID {}
 
 // gets transcript for given ID.  Returns undefined if missing
killedBy: TranscriptManager Create student should return an ID, starting with 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] ObjectLiteral
src/transcriptManager.ts:42:23
 export function addStudent(name: string, grades: CourseGrade[] = []): StudentID {
   const newID = StudentIDManager.newID();
   const newStudent = { studentID: newID, studentName: name };
-  allTranscripts.push({ student: newStudent, grades });
+  allTranscripts.push({});
   return newID;
 }
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: TypeError: Cannot read properties of undefined (reading 'studentID')

[Survived] BlockStatement
src/transcriptManager.ts:47:74
 }
 
 // gets transcript for given ID.  Returns undefined if missing
-export function getTranscript(studentID: number): Transcript | undefined {
-  return allTranscripts.find(transcript => (transcript.student.studentID == studentID));
-}
+export function getTranscript(studentID: number): Transcript | undefined {}
 
 // gets studentIDs matching a given name

[NoCoverage] EqualityOperator
src/transcriptManager.ts:48:45
 
 // gets transcript for given ID.  Returns undefined if missing
 export function getTranscript(studentID: number): Transcript | undefined {
-  return allTranscripts.find(transcript => (transcript.student.studentID == studentID));
+  return allTranscripts.find(transcript => (transcript.student.studentID != studentID));
 }
 

[NoCoverage] ConditionalExpression
src/transcriptManager.ts:48:45
 
 // gets transcript for given ID.  Returns undefined if missing
 export function getTranscript(studentID: number): Transcript | undefined {
-  return allTranscripts.find(transcript => (transcript.student.studentID == studentID));
+  return allTranscripts.find(transcript => (true));
 }
 

[Killed] BlockStatement
src/transcriptManager.ts:52:65
 }
 
 // gets studentIDs matching a given name
-export function getStudentIDs(studentName: string): StudentID[] {
-  return allTranscripts.filter(transcript => (transcript.student.studentName == studentName))
-    .map(transcript => transcript.student.studentID);
-}
+export function getStudentIDs(studentName: string): StudentID[] {}
 
 // deletes student with the given ID from the database.
killedBy: TranscriptManager getStudentIDs Should return only the students who match the name
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ConditionalExpression
src/transcriptManager.ts:53:47
 
 // gets studentIDs matching a given name
 export function getStudentIDs(studentName: string): StudentID[] {
-  return allTranscripts.filter(transcript => (transcript.student.studentName == studentName))
+  return allTranscripts.filter(transcript => (true))
     .map(transcript => transcript.student.studentID);
 }
killedBy: TranscriptManager getStudentIDs Should return only the students who match the name
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 3
Received array: [2, 1]

[Killed] MethodExpression
src/transcriptManager.ts:53:10
 
 // gets studentIDs matching a given name
 export function getStudentIDs(studentName: string): StudentID[] {
-  return allTranscripts.filter(transcript => (transcript.student.studentName == studentName))
+  return allTranscripts
     .map(transcript => transcript.student.studentID);
 }
killedBy: TranscriptManager getStudentIDs Should return only the students who match the name
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 3
Received array: [2, 1]

[Killed] ArrowFunction
src/transcriptManager.ts:54:10
 // gets studentIDs matching a given name
 export function getStudentIDs(studentName: string): StudentID[] {
   return allTranscripts.filter(transcript => (transcript.student.studentName == studentName))
-    .map(transcript => transcript.student.studentID);
+    .map(() => undefined);
 }
 
killedBy: TranscriptManager getStudentIDs Should return only the students who match the name
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: undefined
Received array: [2, 1]

[Killed] BlockStatement
src/transcriptManager.ts:59:59
 
 // deletes student with the given ID from the database.
 // throws exception if no such student.  (Is this the best idea?)
-export function deleteStudent(studentID: StudentID): void {
-  const index = allTranscripts.findIndex(t => (t.student.studentID == studentID));
-  if (index == -1) {
-    throw new Error(`no student with ID = ${studentID}`);
-  }
-  allTranscripts.splice(index, 1);
-}
+export function deleteStudent(studentID: StudentID): void {}
 
 export function addGrade(studentID: StudentID, course: Course, grade: number): void {
killedBy: TranscriptManager Deleting students Should result in the students' transcript no longer being available
statusReason: Error: expect(received).toBeUndefined()

Received: {"grades": [], "student": {"studentID": 1, "studentName": "test student"}}

[Killed] EqualityOperator
src/transcriptManager.ts:60:48
 // deletes student with the given ID from the database.
 // throws exception if no such student.  (Is this the best idea?)
 export function deleteStudent(studentID: StudentID): void {
-  const index = allTranscripts.findIndex(t => (t.student.studentID == studentID));
+  const index = allTranscripts.findIndex(t => (t.student.studentID != studentID));
   if (index == -1) {
     throw new Error(`no student with ID = ${studentID}`);
killedBy: TranscriptManager Deleting students Should result in the students' transcript no longer being available
statusReason: Error: no student with ID = 1

[Killed] ArrowFunction
src/transcriptManager.ts:60:42
 // deletes student with the given ID from the database.
 // throws exception if no such student.  (Is this the best idea?)
 export function deleteStudent(studentID: StudentID): void {
-  const index = allTranscripts.findIndex(t => (t.student.studentID == studentID));
+  const index = allTranscripts.findIndex(() => undefined);
   if (index == -1) {
     throw new Error(`no student with ID = ${studentID}`);
killedBy: TranscriptManager Deleting students Should result in the students' transcript no longer being available
statusReason: Error: no student with ID = 1

[Killed] ConditionalExpression
src/transcriptManager.ts:61:7
 // throws exception if no such student.  (Is this the best idea?)
 export function deleteStudent(studentID: StudentID): void {
   const index = allTranscripts.findIndex(t => (t.student.studentID == studentID));
-  if (index == -1) {
+  if (false) {
     throw new Error(`no student with ID = ${studentID}`);
   }
killedBy: TranscriptManager Deleting students Should throw an error if the ID is invalid
statusReason: Error: expect(received).toThrowError()

Received function did not throw

[Killed] EqualityOperator
src/transcriptManager.ts:61:7
 // throws exception if no such student.  (Is this the best idea?)
 export function deleteStudent(studentID: StudentID): void {
   const index = allTranscripts.findIndex(t => (t.student.studentID == studentID));
-  if (index == -1) {
+  if (index != -1) {
     throw new Error(`no student with ID = ${studentID}`);
   }
killedBy: TranscriptManager Deleting students Should result in the students' transcript no longer being available
statusReason: Error: no student with ID = 1

[Killed] BlockStatement
src/transcriptManager.ts:67:85
   allTranscripts.splice(index, 1);
 }
 
-export function addGrade(studentID: StudentID, course: Course, grade: number): void {
-  const tIndex = allTranscripts.findIndex(t => (t.student.studentID == studentID));
-  if (tIndex == -1) {
-    throw new Error(`no student with ID = ${studentID}`);
-  }
-  const theTranscript = allTranscripts[tIndex];
-  try {
-    allTranscripts[tIndex] = addGradeToTranscript(theTranscript, course, grade);
-  } catch (e) {
-    throw new Error(`student ${studentID} already has a grade in course ${course}`);
-  }
-}
+export function addGrade(studentID: StudentID, course: Course, grade: number): void {}
 
 // returns transcript like the original, but with the new grade added.
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: no grade for student 1 in course test course

[Killed] EqualityOperator
src/transcriptManager.ts:68:49
 }
 
 export function addGrade(studentID: StudentID, course: Course, grade: number): void {
-  const tIndex = allTranscripts.findIndex(t => (t.student.studentID == studentID));
+  const tIndex = allTranscripts.findIndex(t => (t.student.studentID != studentID));
   if (tIndex == -1) {
     throw new Error(`no student with ID = ${studentID}`);
killedBy: tests for errors thrown on lines 76, 85, and 95 addGrade an error should be thrown if a student already has a grade for this course
statusReason: Error: no student with ID = 1

[Killed] ArrowFunction
src/transcriptManager.ts:68:43
 }
 
 export function addGrade(studentID: StudentID, course: Course, grade: number): void {
-  const tIndex = allTranscripts.findIndex(t => (t.student.studentID == studentID));
+  const tIndex = allTranscripts.findIndex(() => undefined);
   if (tIndex == -1) {
     throw new Error(`no student with ID = ${studentID}`);
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: no student with ID = 1

[Killed] ConditionalExpression
src/transcriptManager.ts:69:7
 
 export function addGrade(studentID: StudentID, course: Course, grade: number): void {
   const tIndex = allTranscripts.findIndex(t => (t.student.studentID == studentID));
-  if (tIndex == -1) {
+  if (true) {
     throw new Error(`no student with ID = ${studentID}`);
   }
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: no student with ID = 1

[Killed] EqualityOperator
src/transcriptManager.ts:69:7
 
 export function addGrade(studentID: StudentID, course: Course, grade: number): void {
   const tIndex = allTranscripts.findIndex(t => (t.student.studentID == studentID));
-  if (tIndex == -1) {
+  if (tIndex != -1) {
     throw new Error(`no student with ID = ${studentID}`);
   }
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: no student with ID = 1

[Killed] BlockStatement
src/transcriptManager.ts:73:7
     throw new Error(`no student with ID = ${studentID}`);
   }
   const theTranscript = allTranscripts[tIndex];
-  try {
-    allTranscripts[tIndex] = addGradeToTranscript(theTranscript, course, grade);
-  } catch (e) {
+  try {} catch (e) {
     throw new Error(`student ${studentID} already has a grade in course ${course}`);
   }
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: no grade for student 1 in course test course

[Killed] BlockStatement
src/transcriptManager.ts:75:15
   const theTranscript = allTranscripts[tIndex];
   try {
     allTranscripts[tIndex] = addGradeToTranscript(theTranscript, course, grade);
-  } catch (e) {
-    throw new Error(`student ${studentID} already has a grade in course ${course}`);
-  }
+  } catch (e) {}
 }
 
killedBy: tests for errors thrown on lines 76, 85, and 95 addGrade an error should be thrown if a student already has a grade for this course
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "student 1 already has a grade in course History"

Received function did not throw

[Killed] BlockStatement
src/transcriptManager.ts:82:101
 
 // returns transcript like the original, but with the new grade added.
 // throws an error if the course is already on the transcript
-function addGradeToTranscript(theTranscript: Transcript, course: Course, grade: number): Transcript {
-  const { grades } = theTranscript;
-  if (grades.findIndex(entry => entry.course === course) != -1) {
-    throw new Error();
-  }
-  return { student: theTranscript.student, grades: grades.concat({ course, grade }) };
-}
+function addGradeToTranscript(theTranscript: Transcript, course: Course, grade: number): Transcript {}
 
 //
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: TypeError: Cannot read properties of undefined (reading 'student')

[Killed] ConditionalExpression
src/transcriptManager.ts:84:7
 // throws an error if the course is already on the transcript
 function addGradeToTranscript(theTranscript: Transcript, course: Course, grade: number): Transcript {
   const { grades } = theTranscript;
-  if (grades.findIndex(entry => entry.course === course) != -1) {
+  if (true) {
     throw new Error();
   }
killedBy: tests for errors thrown on lines 76, 85, and 95 addGrade an error should be thrown if a student already has a grade for this course
statusReason: Error: student 1 already has a grade in course History

[Killed] ArrowFunction
src/transcriptManager.ts:84:24
 // throws an error if the course is already on the transcript
 function addGradeToTranscript(theTranscript: Transcript, course: Course, grade: number): Transcript {
   const { grades } = theTranscript;
-  if (grades.findIndex(entry => entry.course === course) != -1) {
+  if (grades.findIndex(() => undefined) != -1) {
     throw new Error();
   }
killedBy: tests for errors thrown on lines 76, 85, and 95 addGrade an error should be thrown if a student already has a grade for this course
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "student 1 already has a grade in course History"

Received function did not throw

[Killed] BlockStatement
src/transcriptManager.ts:91:72
 }
 
 //
-export function getGrade(studentID: StudentID, course: Course): number {
-  const theTranscript = allTranscripts.find(t => t.student.studentID == studentID);
-  const theGrade = theTranscript?.grades.find(g => g.course == course);
-  if (theGrade === undefined) {
-    throw new Error(`no grade for student ${studentID} in course ${course}`);
-  }
-
-  return theGrade.grade;
-
-}
+export function getGrade(studentID: StudentID, course: Course): number {}
 
 
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: undefined

[Killed] EqualityOperator
src/transcriptManager.ts:92:50
 
 //
 export function getGrade(studentID: StudentID, course: Course): number {
-  const theTranscript = allTranscripts.find(t => t.student.studentID == studentID);
+  const theTranscript = allTranscripts.find(t => t.student.studentID != studentID);
   const theGrade = theTranscript?.grades.find(g => g.course == course);
   if (theGrade === undefined) {
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: no grade for student 1 in course test course

[Killed] ConditionalExpression
src/transcriptManager.ts:92:50
 
 //
 export function getGrade(studentID: StudentID, course: Course): number {
-  const theTranscript = allTranscripts.find(t => t.student.studentID == studentID);
+  const theTranscript = allTranscripts.find(t => false);
   const theGrade = theTranscript?.grades.find(g => g.course == course);
   if (theGrade === undefined) {
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: no grade for student 1 in course test course

[Killed] EqualityOperator
src/transcriptManager.ts:93:52
 //
 export function getGrade(studentID: StudentID, course: Course): number {
   const theTranscript = allTranscripts.find(t => t.student.studentID == studentID);
-  const theGrade = theTranscript?.grades.find(g => g.course == course);
+  const theGrade = theTranscript?.grades.find(g => g.course != course);
   if (theGrade === undefined) {
     throw new Error(`no grade for student ${studentID} in course ${course}`);
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: no grade for student 1 in course test course

[Killed] ConditionalExpression
src/transcriptManager.ts:93:52
 //
 export function getGrade(studentID: StudentID, course: Course): number {
   const theTranscript = allTranscripts.find(t => t.student.studentID == studentID);
-  const theGrade = theTranscript?.grades.find(g => g.course == course);
+  const theGrade = theTranscript?.grades.find(g => false);
   if (theGrade === undefined) {
     throw new Error(`no grade for student ${studentID} in course ${course}`);
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: no grade for student 1 in course test course

[Killed] BlockStatement
src/transcriptManager.ts:94:31
 export function getGrade(studentID: StudentID, course: Course): number {
   const theTranscript = allTranscripts.find(t => t.student.studentID == studentID);
   const theGrade = theTranscript?.grades.find(g => g.course == course);
-  if (theGrade === undefined) {
-    throw new Error(`no grade for student ${studentID} in course ${course}`);
-  }
+  if (theGrade === undefined) {}
 
   return theGrade.grade;
killedBy: tests for errors thrown on lines 76, 85, and 95 getGrade an error should be thrown if theres no grade for a student in this course
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "no grade for student 1 in course CS4530"
Received message:   "Cannot read properties of undefined (reading 'grade')"

      259 |       }
      260 |     }
    > 261 |     return theGrade.grade;

[Killed] ConditionalExpression
src/transcriptManager.ts:94:7
 export function getGrade(studentID: StudentID, course: Course): number {
   const theTranscript = allTranscripts.find(t => t.student.studentID == studentID);
   const theGrade = theTranscript?.grades.find(g => g.course == course);
-  if (theGrade === undefined) {
+  if (false) {
     throw new Error(`no grade for student ${studentID} in course ${course}`);
   }
killedBy: tests for errors thrown on lines 76, 85, and 95 getGrade an error should be thrown if theres no grade for a student in this course
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "no grade for student 1 in course CS4530"
Received message:   "Cannot read properties of undefined (reading 'grade')"

      259 |       }
      260 |     }
    > 261 |     return theGrade.grade;

[Killed] StringLiteral
src/transcriptManager.ts:95:21
   const theTranscript = allTranscripts.find(t => t.student.studentID == studentID);
   const theGrade = theTranscript?.grades.find(g => g.course == course);
   if (theGrade === undefined) {
-    throw new Error(`no grade for student ${studentID} in course ${course}`);
+    throw new Error(``);
   }
 
killedBy: tests for errors thrown on lines 76, 85, and 95 getGrade an error should be thrown if theres no grade for a student in this course
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "no grade for student 1 in course CS4530"
Received message:   ""

      256 |       } else {
      257 |         stryCov_9fa48("93");
    > 258 |         throw new Error(stryMutAct_9fa48("94") ? `` : (stryCov_9fa48("94"), `no grade for student ${studentID} in course ${course}`));
